In [2]:
#판다스
import pandas as pd
#데이터를 리스트나 1차원 배열 형식으로 Series클래스 생성자에 넣으주면 시리즈 클래스 객체를 만들 수 있다
#이때 인덱스의 길이는 데이터의 길이와 같아야 한다
s = pd.Series([9904312, 3448737, 2890451, 2466052],
             index = ["서울", "부산", "인천", "대구"])
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [ ]:
#인덱스를 지정하지 않고 시리즈를 만들면 시리즈의 인덱스는 0부터 시작하는 정수값이 된다
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [ ]:
#판다스.index하면 index값 호출
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [ ]:
#판다스.values하면 value값 호출
s.values

array([9904312, 3448737, 2890451, 2466052])

In [ ]:
#name속성을 이용하여 시리즈 데이터에 이름을 붙일 수 있다.
#index.name 속성으로 시리즈의 인덱스에도 이름을 붙일 수 있다.
#value에는 값을 넣을 수 없다. value는 실제 값이니까
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
#시리즈 연산
#넘파이 배열처럼 벡터화 연산을 할 수 있다.
#다만 연산은 시리즈의 값에만 적용되며 인덱스값은 변하지 않는다.
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [ ]:
#인덱스 번호를 넣으나 이름을 넣으나 같은 값이 나온다
print(s[1], s["부산"])
print(s[3], s["대구"])

3448737 3448737
2466052 2466052

In [ ]:
#배열 인덱싱을 하면 부분적인 값을 가지는 시리즈 자료형을 반환한다.
#자료의 순서를 바꾸거나 특정한 자료만 선택할 수 있다.
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [ ]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [ ]:
s[(250e4 < s) & (s < 500e4)]    #인구가 250만 초과 and 500만 미만인 경우

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
#슬라이싱을 해도 부분적인 시리즈를 반환한다.
#이때 문자열을 라벨을 이용한 슬라이싱을 하는 경우에는
#숫자 인덱싱과 달리 콜론(:)기호 뒤에 오는 값도 결과에 포함되므로 주의해야 한다.
s[1:3]    #두번째(1) 부터 세번째(2) 까지(네번째(3)은 미포함, 일반 배열 슬라이스와 같다)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
s["부산":"대구"]    #부산에서 대구까지(대구도 포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
#만약 라벨값이 문자열인 경우에는 인덱스 라벨이 속성인 것처럼
#점을 이용하여 해당 인덱스값에 접근할 수 도 있다.
s0 = pd.Series(range(3), index = ["a","가","c"])
s0

a    0
가    1
c    2
dtype: int64

In [ ]:
s0.a

0

In [ ]:
s0.가

1

In [ ]:
#시리즈 객체는 라벨 값에 의해 인덱싱이 가능하므로 실질적으로
#인덱스 라벨 값을 키로 가지는 딕셔너리 자료형과 같다고 볼 수 있다.
"서울" in s    #인덱스 라벨 중에 서울이 있는가

True

In [ ]:
"대전" in s    #인덱스 라벨 중에 대전이 있는가

False

In [ ]:
for k, v in s.items():
  print("%s = %d" %(k,v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [ ]:
#딕셔너리 객체에서 시리즈를 만들 수도 있다
#아래 데이터에는 대구의 인구 자료는 없지만 대신 대전의 인구자료가 있다
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [ ]:
#딕셔너리의 원소는 순서를 가지지 않으므로 시리즈의 데이터도 순서가 보장되지 않는다.
#만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해야 한다.
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전":1490158},
              index = ["부산","서울","인천","대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [ ]:
#인덱스 기반 연산
#같은 딕셔너리의 값은 빼고 아니면 못뺀다
#여기서는 s와 s2에 서울, 부산, 인천은 공동으로 갖고 있으니까
#계산하지만, 대전/대구는 따로 있으므로 구할 수 없다
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
s.values - s2.values    #인덱스와 관계없이 순서대로 뺀다

array([ 6511121, -6182745,   258416,   975894])

In [ ]:
#대구와 대전의 경우 자료가 양측에 존재하지 않기 때문에 계산이 불가능 하므로
#NaN이라는 값을 가지게 된다
#또한 NaN값이 float자료형에서만 가능하므로 다른 계산 결과도 모두 float자료형외 된다
#NaN이 아닌 값을 구하려면 notnull 메서드 사용
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [ ]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
#도시별 인구 증가율
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [ ]:
#데이터의 갱신, 추가, 삭제
#인덱싱을 이용하면 딕셔너리처럼 데이터를 갱신하거나 추가할 수 있다
#배열은 갱신은 되지만 추가나 삭제가 되지 않는다
rs["부산"] = 1.63    #값 수정(갱신) 가능
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [ ]:
rs["대구"] = 1.41    #인덱스 및 값 추가 가능
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [ ]:
#데이터를 삭제할 때도 딕셔너리처럼 del명령을 사용한다
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [ ]:
#연습문제
#1. 임의로 두개의 시리즈 객체를 만든다.  
#   모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
#2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
pd_d1 = pd.Series([0,1,2,3], index = ['a','b','c','d'])
pd_d2 = pd.Series([10,11,12,13], index = ['a','b','c','e'])
print(  (pd_d1 + pd_d2)[(pd_d1 + pd_d2).notnull()]  )
print(  (pd_d1 - pd_d2)[(pd_d1 - pd_d2).notnull()]  )
print(  (pd_d1 * pd_d2)[(pd_d1 * pd_d2).notnull()]  )
print(  (pd_d1 / pd_d2)[(pd_d1 / pd_d2).notnull()]  )

a    10.0
b    12.0
c    14.0
dtype: float64
a   -10.0
b   -10.0
c   -10.0
dtype: float64
a     0.0
b    11.0
c    24.0
dtype: float64
a    0.000000
b    0.090909
c    0.166667
dtype: float64

In [3]:
#데이터 프레임
#데이터 프레임은 2차원 배열 데이터를 기반으로 한다
#각 열마다 자료형이 다를 수 있다
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141] 
}
Columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
#Columns에 data에 없는 값을 쓰면 표에 nan나온다
Index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = Index, columns = Columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df.values    #데이터

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [ ]:
df.index    #세로축

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [ ]:
df.columns    #가로축

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [ ]:
#시리즈에서처럼 열방향 인덱스와 행방향 인덱스에 이름을 붙이는 것도 가능하다
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
#데이터프레임은 전체를 포함하여 넘파이 2차원 배열이 가지는 대부분의 속성이나 메서드를 지원한다
#즉, 판다스는 1차원과 2차원을 지원한다
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [ ]:
#갱신, 추가, 삭제 가능
#데이터프레임은 열 시리즈의 딕셔너리로 볼 수 있으므로
#열 단위로 데이터를 갱신하거나 추가, 삭제할 수 있다
#"2010-2015 증가율"이라는 이름의 열 변경
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100    #증가율이 100배로 늘어난다
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [ ]:
# "2005-2010 증가율" 이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [ ]:
# "2010-2015 증가율"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [ ]:
#열 인덱싱
#데이터프레임은 열 라벨을 키로, 열 시리즈를 값으로 가지는 딕셔너리와 비슷하다고 했다
#따라서 데이터프레임을 인덱싱 할때도 열 라벨을 키값으로 생각하여 인덱싱을 할 수 있다
#인덱스로 라벨 값을 하나만 넣으면 시리즈 객체가 반환되고
#라벨의 배열 또는 리스트를 넣으면 부분적인 데이터프레임이 반환된다.

#하나의 열만 인덱싱하면 시리즈가 반환된다
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [ ]:
type(df["지역"])

pandas.core.series.Series

In [ ]:
#여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [ ]:
type(df[["2010", "2015"]])

pandas.core.frame.DataFrame

In [4]:
#데이터프레임 [] 안에 그냥 열만 넣으면 시리즈 값으로 나오지만
#[]를 한번 더 만들어서 넣으면 데이터프레임으로 나온다

#2010이라는 열을 반환하면서 데이터프레임 자료형 유지
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [5]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [6]:
#2010이라는 열을 반환하면서 시리즈 자료형으로 변환
df["2010"]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [7]:
type(df["2010"])

pandas.core.series.Series

In [9]:
#데이터프레임에서 문자형으로 넣었을때는 정수로 접근하지 못하지만
#처음부터 정수형으로 작성했다면 숫자로 접근할 수 있다
import numpy as np
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [11]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [12]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [13]:
#행 인덱싱
#만약 행 단위로 인덱싱을 하려면 슬라이싱을 해야된다
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [14]:
df[:1]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [15]:
df[1:2]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [16]:
df[1:3]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [17]:
df["서울":"부산"]    #해당되는 문자열을 직접 입력하면 전체 출력된다

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [18]:
df["서울":"인천"]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [19]:
#개별 데이터 인덱싱
#데이터프레임에서 열 라벨로 시리즈를 인덱싱하면 시리즈가 된다
#이 시리즈를 다시 행 라벨로 인덱싱하면 개별 데이터가 나온다
df["2015"]["서울"]    #df["서울"]["2015"]는 쓸 수 없다

9904312